import Item from "../Item";
import s from "./List.module.scss";

const reviews = [
  {
    id: 1,
    text: `Идейные соображения высшего порядка, а также рамки и место
            обучения кадров обеспечивает широкому кругу (специалистов) участие
            в формировании новых предложений. Идейные соображения высшего
            порядка, а также начало повседневной работы по формированию
            позиции позволяет оценить значение модели развития.`,
    name: "Мария",
    tour: "Тур: Вдали от дома",
    src: "/images/Reviews/review_photo_1.png",
    variant: "first",
  },
  {
    id: 2,
    text: `Равным образом постоянный количественный рост и сфера нашей
            активности играет важную роль в формировании системы обучения
            кадров, соответствует насущным потребностям.\n\n 
            Значимость этих проблем настолько очевидна, что дальнейшее
            развитие различных форм деятельности обеспечивает широкому кругу
            (специалистов) участие в формировании новых предложений.
            Повседневная практика показывает, что реализация намеченных
            плановых заданий в значительной степени обуславливает создание
            модели развития.`,
    name: "Павел",
    tour: "Тур: Путешествие в горы",
    src: "/images/Reviews/review_photo_2.png",
    variant: "second",
  },
];

export default function List() {
  return (
    <ul className={s.reviews}>
      {reviews.map((review) => (
        <Item
          key={review.id}
          text={review.text}
          name={review.name}
          tour={review.tour}
          src={review.src}
          variant={review.variant}
        />
      ))}
    </ul>
  );
}
